hathach/tinyusb/mm327x_gcc/Source/Device/MM32F327x/Source/GCC_StartAsm/startup_mm32m3ux_u_gcc.S
                .weak       MemManage_Handler
                .thumb_set  MemManage_Handler           ,Default_Handler

                .weak       BusFault_Handler
                .thumb_set  BusFault_Handler            ,Default_Handler

                .weak       UsageFault_Handler
                .thumb_set  UsageFault_Handler          ,Default_Handler

                .weak       SVC_Handler
                .thumb_set  SVC_Handler                 ,Default_Handler

                .weak       DebugMon_Handler
                .thumb_set  DebugMon_Handler            ,Default_Handler

                .weak       PendSV_Handler
                .thumb_set  PendSV_Handler              ,Default_Handler

                .weak       SysTick_Handler
                .thumb_set  SysTick_Handler             ,Default_Handler              


                .weak       WWDG_IRQHandler             
                .thumb_set  WWDG_IRQHandler             ,Default_Handler
                                                        
                .weak       PVD_IRQHandler              
                .thumb_set  PVD_IRQHandler              ,Default_Handler
                                                        
                .weak       TAMPER_IRQHandler           
                .thumb_set  TAMPER_IRQHandler           ,Default_Handler
                                                        
                .weak       RTC_IRQHandler              
                .thumb_set  RTC_IRQHandler              ,Default_Handler
                                                        
                .weak       FLASH_IRQHandler            
                .thumb_set  FLASH_IRQHandler            ,Default_Handler
                                                        
                .weak       RCC_CRS_IRQHandler          
                .thumb_set  RCC_CRS_IRQHandler          ,Default_Handler
                                                        
                .weak       EXTI0_IRQHandler            
                .thumb_set  EXTI0_IRQHandler            ,Default_Handler
                                                        
                .weak       EXTI1_IRQHandler            
                .thumb_set  EXTI1_IRQHandler            ,Default_Handler
                                                        
                .weak       EXTI2_IRQHandler            
                .thumb_set  EXTI2_IRQHandler            ,Default_Handler
                                                        
                .weak       EXTI3_IRQHandler            
                .thumb_set  EXTI3_IRQHandler            ,Default_Handler
                                                        
                .weak       EXTI4_IRQHandler            
                .thumb_set  EXTI4_IRQHandler            ,Default_Handler
                                                        
                .weak       DMA1_Channel1_IRQHandler    
                .thumb_set  DMA1_Channel1_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA1_Channel2_IRQHandler    
                .thumb_set  DMA1_Channel2_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA1_Channel3_IRQHandler    
                .thumb_set  DMA1_Channel3_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA1_Channel4_IRQHandler    
                .thumb_set  DMA1_Channel4_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA1_Channel5_IRQHandler    
                .thumb_set  DMA1_Channel5_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA1_Channel6_IRQHandler    
                .thumb_set  DMA1_Channel6_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA1_Channel7_IRQHandler    
                .thumb_set  DMA1_Channel7_IRQHandler    ,Default_Handler
                                                        
                .weak       ADC1_2_IRQHandler           
                .thumb_set  ADC1_2_IRQHandler           ,Default_Handler
                                                        
                .weak       FlashCache_IRQHandler       
                .thumb_set  FlashCache_IRQHandler       ,Default_Handler
                                                        
                .weak       CAN1_RX_IRQHandler          
                .thumb_set  CAN1_RX_IRQHandler          ,Default_Handler
                                                        
                .weak       EXTI9_5_IRQHandler          
                .thumb_set  EXTI9_5_IRQHandler          ,Default_Handler
                                                        
                .weak       TIM1_BRK_IRQHandler         
                .thumb_set  TIM1_BRK_IRQHandler         ,Default_Handler
                                                        
                .weak       TIM1_UP_IRQHandler          
                .thumb_set  TIM1_UP_IRQHandler          ,Default_Handler
                                                        
                .weak       TIM1_TRG_COM_IRQHandler     
                .thumb_set  TIM1_TRG_COM_IRQHandler     ,Default_Handler
                                                        
                .weak       TIM1_CC_IRQHandler          
                .thumb_set  TIM1_CC_IRQHandler          ,Default_Handler
                                                        
                .weak       TIM2_IRQHandler             
                .thumb_set  TIM2_IRQHandler             ,Default_Handler
                                                        
                .weak       TIM3_IRQHandler             
                .thumb_set  TIM3_IRQHandler             ,Default_Handler
                                                        
                .weak       TIM4_IRQHandler             
                .thumb_set  TIM4_IRQHandler             ,Default_Handler
                                                        
                .weak       I2C1_IRQHandler             
                .thumb_set  I2C1_IRQHandler             ,Default_Handler
                                                        
                .weak       I2C2_IRQHandler             
                .thumb_set  I2C2_IRQHandler             ,Default_Handler
                                                        
                .weak       SPI1_IRQHandler             
                .thumb_set  SPI1_IRQHandler             ,Default_Handler
                                                        
                .weak       SPI2_IRQHandler             
                .thumb_set  SPI2_IRQHandler             ,Default_Handler
                                                        
