hathach/tinyusb/mm327x_gcc/Source/Device/MM32F327x/Source/GCC_StartAsm/startup_mm32m3ux_u_gcc.S
                .weak       UART1_IRQHandler            
                .thumb_set  UART1_IRQHandler            ,Default_Handler
                                                        
                .weak       UART2_IRQHandler            
                .thumb_set  UART2_IRQHandler            ,Default_Handler
                                                        
                .weak       UART3_IRQHandler            
                .thumb_set  UART3_IRQHandler            ,Default_Handler
                                                        
                .weak       EXTI15_10_IRQHandler        
                .thumb_set  EXTI15_10_IRQHandler        ,Default_Handler
                                                        
                .weak       RTCAlarm_IRQHandler         
                .thumb_set  RTCAlarm_IRQHandler         ,Default_Handler
                                                        
                .weak       OTG_FS_WKUP_IRQHandler      
                .thumb_set  OTG_FS_WKUP_IRQHandler      ,Default_Handler
                                                        
                .weak       TIM8_BRK_IRQHandler         
                .thumb_set  TIM8_BRK_IRQHandler         ,Default_Handler
                                                        
                .weak       TIM8_UP_IRQHandler          
                .thumb_set  TIM8_UP_IRQHandler          ,Default_Handler
                                                        
                .weak       TIM8_TRG_COM_IRQHandler     
                .thumb_set  TIM8_TRG_COM_IRQHandler     ,Default_Handler
                                                        
                .weak       TIM8_CC_IRQHandler          
                .thumb_set  TIM8_CC_IRQHandler          ,Default_Handler
                                                        
                .weak       ADC3_IRQHandler             
                .thumb_set  ADC3_IRQHandler             ,Default_Handler
                                                        
                .weak       SDIO_IRQHandler             
                .thumb_set  SDIO_IRQHandler             ,Default_Handler
                                                        
                .weak       TIM5_IRQHandler             
                .thumb_set  TIM5_IRQHandler             ,Default_Handler
                                                        
                .weak       SPI3_IRQHandler             
                .thumb_set  SPI3_IRQHandler             ,Default_Handler
                                                        
                .weak       UART4_IRQHandler            
                .thumb_set  UART4_IRQHandler            ,Default_Handler
                                                        
                .weak       UART5_IRQHandler            
                .thumb_set  UART5_IRQHandler            ,Default_Handler
                                                        
                .weak       TIM6_IRQHandler             
                .thumb_set  TIM6_IRQHandler             ,Default_Handler
                                                        
                .weak       TIM7_IRQHandler             
                .thumb_set  TIM7_IRQHandler             ,Default_Handler
                                                        
                .weak       DMA2_Channel1_IRQHandler    
                .thumb_set  DMA2_Channel1_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA2_Channel2_IRQHandler    
                .thumb_set  DMA2_Channel2_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA2_Channel3_IRQHandler    
                .thumb_set  DMA2_Channel3_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA2_Channel4_IRQHandler    
                .thumb_set  DMA2_Channel4_IRQHandler    ,Default_Handler
                                                        
                .weak       DMA2_Channel5_IRQHandler    
                .thumb_set  DMA2_Channel5_IRQHandler    ,Default_Handler
                                                        
                .weak       ETH_IRQHandler              
                .thumb_set  ETH_IRQHandler              ,Default_Handler
                                                        
                .weak       COMP1_2_IRQHandler          
                .thumb_set  COMP1_2_IRQHandler          ,Default_Handler
                                                        
                .weak       OTG_FS_IRQHandler           
                .thumb_set  OTG_FS_IRQHandler           ,Default_Handler
                                                        
                .weak       UART6_IRQHandler            
                .thumb_set  UART6_IRQHandler            ,Default_Handler
                                                        
                .weak       UART7_IRQHandler            
                .thumb_set  UART7_IRQHandler            ,Default_Handler
                                                        
                .weak       UART8_IRQHandler            
                .thumb_set  UART8_IRQHandler            ,Default_Handler




/****END OF FILE****/

